<?php
// 아래처럼 별을 찍어주세요.
// 예시)
// *****
// *****
// *****
// *****
// *****


for ($j = 1; $j < 6; $j++) {
    for ($i = 1; $i < 6; $i++) {
        echo "*";
    }
    echo "\n";
}
echo "\n";

// 아래처럼 별을 찍어주세요.
// 예시)
// *
// **
// ***
// ****
// *****


for ($i = 1; $i < 6; $i++) {
    for ($j = 1; $j < $i+1; $j++){
        echo "*";
    }
    echo "\n";
}
echo "\n";


// 아래처럼 별을 찍어주세요.
// 예시)
//     *
//    **
//   ***
//  ****
// *****

for ($i = 1; $i < 6; $i++) {
    for ($j = 1; $j < 6-$i; $j++){
        echo " ";   
    }
    for ($k = 1; $k < $i+1; $k++){
        echo "*";
    }
    echo "\n";
}
echo "\n";