<?php

// 1~100 까지 숫자가 있어요.
// 3의 배수를 제외하고 아래처럼 출력해 주세요.
// 1입니다.
// 2입니다.
// 4입니다.
// ...
// 100입니다.


$j = 100;
for ( $i=1; $i <= $j; $i++) {
    if ( $i % 3 !== 0 ) {
        echo $i."입니다.\n";
    }
    else {
        echo "짝\n";
    }
}

// 풀이
$arr = range(1, 100);

foreach($arr as $val) {
    if(($val % 3) === 0) {
        continue;
    }
    echo $val."입니다.\n";
}


// 다시 해보기
// $num_3 = [];
// for ($i=1; $i<=34; $i++) {
//     $num_3[] = ($i*3);
//     for ($j=1; $j <= 100; $j++ )
//     if ( $j !== $num_3) {
//         echo $j."\n";
//     }
// }


// $arr[$i] 